# SpatialElementGeometryResults Properties

---
The SpatialElementGeometryResults type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
SpatialElementGeometryResults Class
Autodesk.Revit.DB Namespace